[
    {
        "title": "Vegan Chocolate Banana Pie",
        "readyInMinutes": 45,
        "summary": "If you have approximately <b>about 45 minutes</b> to spend in the kitchen, Vegan Chocolate Banana Pie might be a spectacular <b>dairy free</b> recipe to try. This recipe serves 6 and costs $1.12 per serving. This dessert has <b>347 calories</b>, <b>3g of protein</b>, and <b>17g of fat</b> per serving. Head to the store and pick up cornstarch-mixed, bananas, chocolate-melted in a bain marie, and a few other things to make it today. 23 people have made this recipe and would make it again. It is brought to you by Foodista. Taking all factors into account, this recipe <b>earns a spoonacular score of 33%</b>, which is not so super. Similar recipes include <a href=\"https://spoonacular.com/recipes/vegan-banana-pie-cup-668303\">Vegan Banana Pie Cup</a>, <a href=\"https://spoonacular.com/recipes/raw-vegan-banana-cream-pie-500260\">Raw Vegan Banana Cream Pie</a>, and <a href=\"https://spoonacular.com/recipes/vegan-banana-cream-pie-blizzards-607873\">Vegan Banana Cream Pie Blizzards</a>.",
        "vegetarian": false,
        "instructions": "In a blender, add tofu and mix until creamy,\nAdd bananas.\nMelt chocolate in a bowl on top of a pot of boiling water\nAdd  chocolate to blender, add cornstarch and maple syrup.\nPour into a precooked pie crust, and place in the fridge for as long as possible.",
        "sourceUrl": "https://www.foodista.com/recipe/GL3CS5WF/vegan-chocolate-banana-pie",
        "image": "https://spoonacular.com/recipeImages/664408-556x370.jpg",
        "id": 664408
    },
    {
        "title": "White chocolate-cranberry ice cream",
        "readyInMinutes": 45,
        "summary": "White chocolate-cranberry ice cream is a <b>gluten free</b> dessert. This recipe makes 6 servings with <b>430 calories</b>, <b>6g of protein</b>, and <b>28g of fat</b> each. For <b>$1.44 per serving</b>, this recipe <b>covers 7%</b> of your daily requirements of vitamins and minerals. A few people made this recipe, and 16 would say it hit the spot. Head to the store and pick up vanillan extract, cranberries, egg yolks, and a few other things to make it today. It will be a hit at your <b>Summer</b> event. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 27%</b>. This score is rather bad. Try <a href=\"https://spoonacular.com/recipes/the-secret-ingredient-cranberry-cranberry-ice-cream-with-white-chocolate-chunks-207558\">The Secret Ingredient (Cranberry): Cranberry Ice Cream with White Chocolate Chunks</a>, <a href=\"https://spoonacular.com/recipes/white-chocolate-blackberry-cranberry-cream-bars-690423\">White Chocolate Blackberry Cranberry Cream Bars</a>, and <a href=\"https://spoonacular.com/recipes/cranberry-cream-cheese-white-chocolate-chip-cookies-506006\">Cranberry Cream Cheese White Chocolate Chip Cookies</a> for similar recipes.",
        "vegetarian": false,
        "instructions": "<ol><li>In a medium saucepan boil the milk until it starts to bubble gently. Remove from flame and set aside.</li><li>Meanwhile whisk the egg yolks and sugar together for 3 minutes until pale yellow and double in volume.</li><li>Pour the milk on to the egg mixture and stir and then gently pour the mixture back in to the saucepan and simmer very lightly. Stir continuously until the custard mix thickens or coats the back of a wooden spoon.</li><li>Add the chopped chocolate stirring until the heat melts the chocolate.</li><li>Cool the mixture, stir in the vanilla extract and put it in the fridge to chill.</li><li>Once chilled, add the cream to the mixture. Stir and combine.</li><li>Pour the mixture into an ice cream machine and churn until frozen.</li><li>Add  dried cranberries in the last 5 minutes of churning and let the machine stir them in.</li><li>Transfer to plastic container and place in the freezer for 3 hours before serving.</li></ol>",
        "sourceUrl": "http://www.foodista.com/recipe/HSYFZTRN/white-chocolate-cranberries-ice-cream",
        "image": "https://spoonacular.com/recipeImages/665203-556x370.jpg",
        "id": 665203
    },
    {
        "title": "Quinoa Salad with Barberries & Nuts",
        "readyInMinutes": 30,
        "summary": "Quinoa Salad with Barberries & Nuts requires roughly <b>30 minutes</b> from start to finish. This recipe serves 4 and costs $2.3 per serving. One portion of this dish contains approximately <b>16g of protein</b>, <b>19g of fat</b>, and a total of <b>477 calories</b>. 1 person were glad they tried this recipe. Head to the store and pick up dried barberries, water, mint, and a few other things to make it today. It works well as a reasonably priced main course. It is a good option if you're following a <b>gluten free, dairy free, lacto ovo vegetarian, and vegan</b> diet. It is brought to you by Foodista. Taking all factors into account, this recipe <b>earns a spoonacular score of 93%</b>, which is outstanding. If you like this recipe, take a look at these similar recipes: <a href=\"https://spoonacular.com/recipes/quinoa-salad-with-dried-fruit-and-nuts-484499\">Quinoa Salad with Dried Fruit and Nuts</a>, <a href=\"https://spoonacular.com/recipes/quinoa-salad-with-summer-veggies-and-pine-nuts-677767\">Quinoa Salad with Summer Veggies and Pine Nuts</a>, and <a href=\"https://spoonacular.com/recipes/cold-quinoa-salad-with-chicken-pine-nuts-feta-18956\">Cold Quinoa Salad With Chicken, Pine Nuts & Feta</a>.",
        "vegetarian": true,
        "instructions": "<ol><li>Put the quinoa in a sieve and rinse under running water. Drain. </li><li>Pour the boiling water over quinoa in a medium saucepan. </li><li>Add salt, stir well and cook over medium-low heat until quinoa is cooked through but still has a bite in the center. Drain in a sieve.</li><li>Pick over the barberries, rinse in a sieve and dry on kitchen paper.</li><li>While the quinoa is cooking, heat 1 tablespoon of oil in a saucepan over medium heat and lightly toast the almond slivers. Add the slivered pistachios, then the rest of the oil and the rinsed barberries. Cook briefly until the barberries are shiny and a little puffed.</li><li>Save a tablespoon of the barberry and nut mix and a tablespoon of the chopped herbs for garnishing the finished dish. </li><li>Mix all of the remaining nut and barberry mix, herbs and quinoa. </li><li>Return to the pot and place on low heat. Cover with a lid and cook for ten minutes or until completely heated through and steam is rising. </li><li>Turn into a serving dish and fluff with a fork. </li><li>Add a little extra olive oil and a twist of black pepper if you wish.</li><li>Sprinkle the quinoa with the rest of the berry-nut mix and chopped herbs and serve on its own as a main dish or as a side dish.</li></ol>",
        "sourceUrl": "https://www.foodista.com/recipe/PBQJCDDG/quinoa-salad-with-barberries-nuts",
        "image": "https://spoonacular.com/recipeImages/1098387-556x370.jpg",
        "id": 1098387
    },
    {
        "title": "Ultimate Chocolate Chunk Cookies",
        "readyInMinutes": 24,
        "summary": "Ultimate Chocolate Chunk Cookies might be just the dessert you are searching for. For <b>$1.23 per serving</b>, this recipe <b>covers 12%</b> of your daily requirements of vitamins and minerals. This recipe makes 6 servings with <b>670 calories</b>, <b>8g of protein</b>, and <b>44g of fat</b> each. 291 person were impressed by this recipe. From preparation to the plate, this recipe takes roughly <b>24 minutes</b>. A mixture of chocolate chips, vanilla flavoring, baking powder, and a handful of other ingredients are all it takes to make this recipe so delicious. All things considered, we decided this recipe <b>deserves a spoonacular score of 46%</b>. This score is good. Try <a href=\"https://spoonacular.com/recipes/ultimate-chocolate-chunk-cookies-496912\">{Ultimate} Chocolate Chunk Cookies</a>, <a href=\"https://spoonacular.com/recipes/dark-chocolate-chunk-and-peanut-butter-chip-chocolate-cookies-520616\">Dark Chocolate Chunk and Peanut Butter Chip Chocolate Cookies</a>, and <a href=\"https://spoonacular.com/recipes/paleo-chocolate-chunk-shortbread-cookies-with-homemade-honey-sweetened-chocolate-chunks-551601\">Paleo Chocolate Chunk Shortbread Cookies [with homemade honey sweetened chocolate chunks]</a> for similar recipes.",
        "vegetarian": false,
        "instructions": "Preheat oven to 350.Mix together in a medium bowl the flour, baking soda, and salt.Carefully soften chocolate chips, butter, and vanilla flavoring in the microwave in 15 second increments, stirring in between, for one full minute.Beat eggs and sugar together until light an fluffy.Reduce blender speed and combine the melted chocolate chips, butter, vanilla, and slowly mix in the flour.Add in the chocolate chunks and pecans until mixed.Drop 1 tablespoon of dough onto cookie sheet, 2 - 3 inches apart and bake for 12-14 minutes, keeping your center soft and chewy. Allow to cool for 10 minutes before moving to a cooling rack to cool completely.",
        "sourceUrl": "http://www.pinkwhen.com/ultimate-chocolate-chunk-cookies/",
        "image": "https://spoonacular.com/recipeImages/715483-556x370.jpg",
        "id": 715483
    },
    {
        "title": "Curried Butternut Squash and Apple Soup",
        "readyInMinutes": 45,
        "summary": "If you want to add more <b>gluten free, dairy free, lacto ovo vegetarian, and vegan</b> recipes to your recipe box, Curried Butternut Squash and Apple Soup might be a recipe you should try. This recipe serves 1 and costs $1.42 per serving. One portion of this dish contains about <b>9g of protein</b>, <b>3g of fat</b>, and a total of <b>139 calories</b>. It is brought to you by Foodista. 9 people found this recipe to be yummy and satisfying. It works well as a reasonably priced soup. From preparation to the plate, this recipe takes approximately <b>approximately 45 minutes</b>. If you have cauliflower, curry powder, braggs liquid aminos, and a few other ingredients on hand, you can make it. <b>Autumn</b> will be even more special with this recipe. All things considered, we decided this recipe <b>deserves a spoonacular score of 89%</b>. This score is super. Similar recipes are <a href=\"https://spoonacular.com/recipes/curried-butternut-squash-and-apple-soup-836936\">Curried Butternut Squash and Apple Soup</a>, <a href=\"https://spoonacular.com/recipes/curried-apple-+-butternut-squash-soup-620121\">Curried Apple + Butternut Squash Soup</a>, and <a href=\"https://spoonacular.com/recipes/curried-butternut-squash-apple-soup-crock-pot-94742\">Curried Butternut Squash & Apple Soup - Crock Pot</a>.",
        "vegetarian": true,
        "instructions": "Get ready two small saucepans.\nIn one have together 1/2 of the squash and 1/2 of the apple  bring to a simmer, and simmer until just tender when pierced with a fork.\nIn the other, add in the rest of the vegetables along with 1 cup of water  bring this to a rolling boil, reduce to a simmer, and simmer until very very tender. When very tender, remove the vegetables from the heat, and blend these vegetables together (without draining) with the Braggs, spices, sriracha and the additional 1/2 cup water.\nMix the blended part of the soup with the simmered squash and apples. Mix in the cubed tofu, gently re-heat and serve.",
        "sourceUrl": "https://www.foodista.com/recipe/FKQCYKYR/curried-butternut-squash-and-apple-soup",
        "image": "https://spoonacular.com/recipeImages/641057-556x370.jpg",
        "id": 641057
    },
    {
        "title": "Summer Berry Salad",
        "readyInMinutes": 45,
        "summary": "Summer Berry Salad might be just the side dish you are searching for. Watching your figure? This caveman, gluten free, primal, and vegan recipe has <b>98 calories</b>, <b>2g of protein</b>, and <b>1g of fat</b> per serving. This recipe serves 1 and costs $1.75 per serving. 17 people have tried and liked this recipe. If you have apples, blackberries, romaine lettuce, and a few other ingredients on hand, you can make it. It can be enjoyed any time, but it is especially good for <b>The Fourth Of July</b>. From preparation to the plate, this recipe takes approximately <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 98%</b>. This score is outstanding. Try <a href=\"https://spoonacular.com/recipes/berry-summer-salad-50848\">Berry Summer Salad</a>, <a href=\"https://spoonacular.com/recipes/summer-berry-salad-485592\">Summer Berry Salad</a>, and <a href=\"https://spoonacular.com/recipes/chicken-berry-summer-salad-769303\">Chicken & Berry Summer Salad</a> for similar recipes.",
        "vegetarian": true,
        "instructions": "Cut up a Granny Smith green apple, strawberries, and add blackberriesMix in with Romaine lettuceToss in some basalmic vinaigrette",
        "sourceUrl": "http://www.pinkwhen.com/summer-berry-salad/",
        "image": "https://spoonacular.com/recipeImages/715540-556x370.jpg",
        "id": 715540
    },
    {
        "title": "Creamy Cauliflower Chowder",
        "readyInMinutes": 40,
        "summary": "Creamy Cauliflower Chowder might be just the main course you are searching for. This recipe serves 8 and costs $1.31 per serving. One serving contains <b>354 calories</b>, <b>17g of protein</b>, and <b>25g of fat</b>. Many people made this recipe, and 104 would say it hit the spot. From preparation to the plate, this recipe takes approximately <b>40 minutes</b>. Head to the store and pick up parmesan cheese, garlic, croutons, and a few other things to make it today. To use up the bacon you could follow this main course with the <a href=\"https://spoonacular.com/recipes/mini-maple-bacon-upside-down-cakes-592975\">Mini Maple Bacon Upside Down Cakes</a> as a dessert. All things considered, we decided this recipe <b>deserves a spoonacular score of 58%</b>. This score is solid. Try <a href=\"https://spoonacular.com/recipes/cauliflower-gnocchi-with-creamy-cauliflower-shiitake-mushroom-sauce-497007\">Cauliflower Gnocchi with Creamy Cauliflower Shiitake Mushroom Sauce</a>, <a href=\"https://spoonacular.com/recipes/creamy-cauliflower-soup-with-parmesan-cauliflower-crumbs-247685\">Creamy Cauliflower Soup with Parmesan Cauliflower Crumbs</a>, and <a href=\"https://spoonacular.com/recipes/cauliflower-chowder-535778\">Cauliflower Chowder</a> for similar recipes.",
        "vegetarian": false,
        "instructions": "Add butter, garlic, onion and cauliflower to a large pot and saute for 5 minutes until cauliflower starts to brown.Add flour, chicken bouillon, ground mustard, paprika, salt and mix well, then add 2 cups milk and stir. Reduce heat and boil for 10 minutes, cauliflower should be soft.Add to a blender and blend until smooth. Transfer back to the pot and add the rest of the milk. Add parmesan cheese, cheddar cheese and stir until melted.When cheese is melted and its heated through, serve in bowls and top with bacon, croutons and extra cheese.",
        "sourceUrl": "http://www.pinkwhen.com/creamy-cauliflower-chowder/",
        "image": "https://spoonacular.com/recipeImages/724324-556x370.jpg",
        "id": 724324
    },
    {
        "title": "Cauliflower, Brown Rice, and Vegetable Fried Rice",
        "readyInMinutes": 30,
        "summary": "Cauliflower, Brown Rice, and Vegetable Fried Rice might be a good recipe to expand your side dish recipe box. Watching your figure? This gluten free, dairy free, lacto ovo vegetarian, and vegan recipe has <b>192 calories</b>, <b>7g of protein</b>, and <b>6g of fat</b> per serving. For <b>$1.12 per serving</b>, this recipe <b>covers 19%</b> of your daily requirements of vitamins and minerals. This recipe serves 8. This recipe from fullbellysisters.blogspot.com has 3689 fans. This recipe is typical of Chinese cuisine. From preparation to the plate, this recipe takes about <b>30 minutes</b>. Head to the store and pick up peas, broccoli, salt, and a few other things to make it today. Overall, this recipe earns an <b>awesome spoonacular score of 100%</b>. Users who liked this recipe also liked <a href=\"https://spoonacular.com/recipes/vegetable-fried-brown-rice-36199\">Vegetable Fried Brown Rice</a>, <a href=\"https://spoonacular.com/recipes/vegetable-fried-cauliflower-rice-933261\">Vegetable Fried Cauliflower Rice</a>, and <a href=\"https://spoonacular.com/recipes/easy-vegetable-fried-brown-rice-with-egg-802042\">Easy Vegetable Fried Brown Rice with Egg</a>.",
        "vegetarian": true,
        "instructions": "<ol><li><span></span>Remove the cauliflower's tough stem and reserve for another use. Using a food processor, pulse cauliflower florets until they resemble rice or couscous. You should end up with around four cups of \"cauliflower rice.\"</li><li>Heat 1T butter and 1T oil in a large skillet over medium heat. Add garlic and the white and light green pieces of scallion. Sauté about a minute.</li><li>Add the cauliflower to the pan. Stir to coat with oil, then spread out in pan and let sit; you want it cook a bit and to caramelize (get a bit brown), which will bring out the sweetness. After a couple of minutes, stir and spread out again.</li><li>Add cold rice (it separates easily, so it won't clump up during cooking), plus the additional grapeseed and coconut oil or butter. Raise heat to medium-high. Toss everything together and, again, spread the mixture out over the whole pan and press a bit into the bottom. Let it sit for about two minutes—so the rice can get toasted and a little crispy. Add the peas and broccoli and stir again. Drizzle soy sauce and toasted sesame oil over rice.</li><li>Cook for another minute or so and turn off heat. Add chopped scallion tops and toss.</li><li>I like to toast some sesame seeds in a dry pan; I sprinkle these and some more raw, chopped scallion over the top of the rice for added flavor and crunch.</li><li>Season to taste with salt and, if you'd like, more soy sauce. Keep in mind that if you're serving this with something salty and saucy (ie. teriyaki chicken) you may want to hold off on adding too much salt to the fried rice.</li></ol>",
        "sourceUrl": "http://fullbellysisters.blogspot.com/2012/01/cauliflower-fried-rice-more-veggies.html",
        "image": "https://spoonacular.com/recipeImages/716426-556x370.jpg",
        "id": 716426
    },
    {
        "title": "Delicious Triple Chocolate Bundt Cake",
        "readyInMinutes": 55,
        "summary": "Delicious Triple Chocolate Bundt Cake is a <b>gluten free</b> dessert. One serving contains <b>561 calories</b>, <b>7g of protein</b>, and <b>15g of fat</b>. For <b>100 cents per serving</b>, this recipe <b>covers 7%</b> of your daily requirements of vitamins and minerals. Several people made this recipe, and 1473 would say it hit the spot. If you have chocolate fudge pudding mix, devil's food cake mix, cream, and a few other ingredients on hand, you can make it. From preparation to the plate, this recipe takes approximately <b>55 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 38%</b>. This score is rather bad. Try <a href=\"https://spoonacular.com/recipes/triple-chocolate-bundt-cake-618310\">Triple chocolate bundt cake</a>, <a href=\"https://spoonacular.com/recipes/triple-chocolate-bundt-cake-494013\">Triple Chocolate Bundt Cake</a>, and <a href=\"https://spoonacular.com/recipes/triple-chocolate-zucchini-bundt-cake-671357\">Triple Chocolate Zucchini Bundt Cake</a> for similar recipes.",
        "vegetarian": false,
        "instructions": "Preheat your oven to 350 degrees. Mix the cake as directed. Add the pudding and sour cream. Mix well. Stir in chocolate chips.Spray a bundt pan generously with non-stick spray and then coat with flour. Bake for 50 minutes. Cool for 5 minutes and dump onto the cooling rack.Optional: serve warm sliced with a drizzle of Dove milk chocolate ice cream topping and a scoop of vanilla ice cream.",
        "sourceUrl": "http://www.pinkwhen.com/delicious-triple-chocolate-bundt-cake/",
        "image": "https://spoonacular.com/recipeImages/715452-556x370.jpg",
        "id": 715452
    }
]