{
    "data": [
        {
            "title": "Strawberry-Mango Quinoa Salad",
            "readyInMinutes": 45,
            "summary": "Strawberry-Mango Quinoa Salad might be just the side dish you are searching for. One serving contains <b>334 calories</b>, <b>7g of protein</b>, and <b>17g of fat</b>. For <b>$1.46 per serving</b>, this recipe <b>covers 15%</b> of your daily requirements of vitamins and minerals. 41 person have tried and liked this recipe. A mixture of cucumber, mint, lime juice, and a handful of other ingredients are all it takes to make this recipe so tasty. It is a good option if you're following a <b>gluten free and vegetarian</b> diet. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 92%</b>. This score is spectacular. Try <a href=\"https://spoonacular.com/recipes/strawberry-mango-chopped-spinach-quinoa-salad-with-sesame-lime-vinaigrette-809898\">Strawberry & Mango Chopped Spinach Quinoa Salad with Sesame-Lime Vinaigrette</a>, <a href=\"https://spoonacular.com/recipes/strawberry-goat-cheese-quinoa-salad-with-strawberry-balsamic-dressing-586470\">Strawberry Goat Cheese Quinoa Salad with Strawberry Balsamic Dressing</a>, and <a href=\"https://spoonacular.com/recipes/red-quinoa-and-mango-salad-702734\">Red Quinoan and Mango Salad</a> for similar recipes.",
            "vegetarian": true,
            "instructions": "<ol><li>Prepare the quinoa: In a medium saucepan combine the quinoa, water and 1/4 t. salt. Bring to a boil, reduce heat to low, cover and simmer until the liquid is just absorbed, about 15 minutes. Spread the cooked quinoa out on a baking sheet to cool for about 20 minutes.</li><li>In a large bowl whisk together lime juice, zest, honey, sour cream and olive oil. Add the cooled quinoa, strawberries, mango, cucumber and mint. Toss well to combine and season with salt &amp; pepper. Serve immediately.</li></ol>",
            "sourceUrl": "http://www.foodista.com/recipe/K2BYJP76/strawberry-mango-quinoa-salad",
            "image": "https://spoonacular.com/recipeImages/661925-556x370.jpg",
            "id": 661925
        },
        {
            "title": "Dandelion pesto",
            "readyInMinutes": 45,
            "summary": "Dandelion pesto is a <b>gluten free, dairy free, paleolithic, and lacto ovo vegetarian</b> condiment. This recipe serves 4 and costs $1.33 per serving. One portion of this dish contains approximately <b>2g of protein</b>, <b>20g of fat</b>, and a total of <b>192 calories</b>. If you have dandelion greens, pine nuts, macadamia nuts, and a few other ingredients on hand, you can make it. 103 people have made this recipe and would make it again. It is brought to you by Foodista. From preparation to the plate, this recipe takes approximately <b>approximately 45 minutes</b>. Taking all factors into account, this recipe <b>earns a spoonacular score of 60%</b>, which is solid. If you like this recipe, you might also like recipes such as <a href=\"https://spoonacular.com/recipes/dandelion-pesto-14296\">Dandelion Pesto</a>, <a href=\"https://spoonacular.com/recipes/dandelion-pumpkin-seed-pesto-14309\">Dandelion Pumpkin Seed Pesto</a>, and <a href=\"https://spoonacular.com/recipes/almond-herb-tarts-with-dandelion-pesto-truffled-fontina-figs-9087\">Almond Herb Tarts With Dandelion Pesto, Truffled Fontina & Figs</a>.",
            "vegetarian": true,
            "instructions": "Wash the dandelion well in a solution of water and raw cider vinegar, using a couple of tablespoons of vinegar to about a litre of water. Wash and spin dry all the greens. Pop all the ingredients into a pestle and mortar or food processor and pound/blitz till nearly smooth - I like to leave a little texture to my pesto but play around with it. And that's it! Pretty simple and very scrummy.",
            "sourceUrl": "https://www.foodista.com/recipe/H3PMVLPC/dandelion-pesto",
            "image": "https://spoonacular.com/recipeImages/641227-556x370.jpg",
            "id": 641227
        },
        {
            "title": "Boozy Bbq Chicken",
            "readyInMinutes": 45,
            "summary": "The recipe Boozy Bbq Chicken could satisfy your American craving in approximately <b>45 minutes</b>. Watching your figure? This gluten free and dairy free recipe has <b>710 calories</b>, <b>32g of protein</b>, and <b>33g of fat</b> per serving. For <b>$3.23 per serving</b>, you get a main course that serves 6. This recipe from Foodista has 72 fans. If you have garlic, tabasco sauce, chicken, and a few other ingredients on hand, you can make it. To use up the beer you could follow this main course with the <a href=\"https://spoonacular.com/recipes/guinness-whiskey-irish-cream-cupcakes-508129\">Guinness, Whiskey & Irish Cream Cupcakes</a> as a dessert. All things considered, we decided this recipe <b>deserves a spoonacular score of 93%</b>. This score is awesome. Try <a href=\"https://spoonacular.com/recipes/the-best-bbq-chicken-marinade-908666\">The BEST BBQ Chicken Marinade</a>, <a href=\"https://spoonacular.com/recipes/bbq-cheddar-chicken-925478\">BBQ Cheddar Chicken</a>, and <a href=\"https://spoonacular.com/recipes/bbq-chicken-chopped-salad-923920\">BBQ Chicken Chopped Salad</a> for similar recipes.",
            "vegetarian": false,
            "instructions": "<ol><li>DIRECTIONS:</li><li>Open beer start to drink.</li><li>Soak wooden skewers in a shallow dish filled with water. In a large glass or ceramic dish, mix orange juice, olive oil, wine, soy sauce, Sriracha or Tabasco sauce, molasses, garlic, ginger and pepper.</li><li>Cut orange, peppers, onion & broccoli into large bite-sized chunks (at least 1\" thick) and place in the dish.</li><li>Add mushrooms and tomatoes.</li><li>Stir veggies in marinade to coat.</li><li>Cover and refrigerate while you prep chicken.</li><li>Warm outdoor grill to medium heat.</li><li>Rinse chicken and pat dry with paper towel (toss that towel!).</li><li>In small bowl mix mustard, salt and pepper. Brush chicken with mustard mixture.</li><li>Wash your hands and go stir those veggies so all sides absorb the marinade.</li><li>When beer is half empty, refill can with salad dressing and squeeze in juice from 1/2 lemon.</li><li>Put can on a disposable baking sheet. Place upright chicken on can like a stand, inserting can into cavity of chicken.</li><li>Place baking sheet with beer and chicken on the preheated grill.</li><li>Cover. Set your time for 1 hour.</li><li>Start on a second beer or that remaining white wine.</li><li>In a medium saucepan, pour rice, water, and 3-4 splashes of your beverage (about 1/4 cup) into medium sauce pan.</li><li>Bring to a boil, stir and reduce heat to low.</li><li>Cover with lid and cook for 25-30 minutes.</li><li>Back to the kebabs.</li><li>Remove veggies from fridge and using the sharp end of the skewer begin threading.</li><li>Distribute veggies evenly onto 6-8 skewers.</li><li>Check rice: It's done when all liquid is absorbed but before it starts sticking to the bottom of the pan.</li><li>Turn off heat under the rice and let it sit.</li><li>Go back to grill.</li><li>You should be at about an hour on the chicken.</li><li>Carefully slice in to see meat has gone from pink to white.</li><li>Remove from grill</li><li>Allow to cool for at least 15 minutes so you don't burn the hell out of yourself cutting it into pieces for your guest(s).</li><li>In the meantime throw those kebabs directly on the grill.</li><li>Flip them over after about 5 minutes to get the other side and allow to cook for another 5-8min.</li><li>Kebabs are done when veggies are al dente (softened but still firm).</li><li>Turn off grill and remove from heat.</li><li>Put rice in a serving dish, and chicken pieces and full skewers on a platter. Squeeze remaining lemon juice over chicken.</li><li>Let people serve themselves.</li><li>Eat, drink and be merry!</li><li>DW | Food and Drink</li></ol>",
            "sourceUrl": "http://www.foodista.com/recipe/2ZPN8F4S/boozy-bbq-chicken",
            "image": "https://spoonacular.com/recipeImages/635675-556x370.jpg",
            "id": 635675
        },
        {
            "title": "Pulled Pork Nachos",
            "readyInMinutes": 490,
            "summary": "You can never have too many hor d'oeuvre recipes, so give Pulled Pork Nachos a try. This recipe makes 8 servings with <b>358 calories</b>, <b>19g of protein</b>, and <b>17g of fat</b> each. For <b>$1.63 per serving</b>, this recipe <b>covers 19%</b> of your daily requirements of vitamins and minerals. Not a lot of people made this recipe, and 6 would say it hit the spot. This recipe is typical of Mexican cuisine. This recipe from Pink When requires pork shoulder, vegetable broth, nacho chips, and cheese. It is a good option if you're following a <b>gluten free</b> diet. From preparation to the plate, this recipe takes approximately <b>8 hours and 10 minutes</b>. Overall, this recipe earns a <b>rather bad spoonacular score of 14%</b>. If you like this recipe, you might also like recipes such as <a href=\"https://spoonacular.com/recipes/pulled-pork-nachos-498935\">Pulled Pork Nachos</a>, <a href=\"https://spoonacular.com/recipes/pulled-pork-nachos-687166\">Pulled Pork Nachos</a>, and <a href=\"https://spoonacular.com/recipes/pulled-pork-nachos-754323\">Pulled Pork Nachos</a>.",
            "vegetarian": false,
            "instructions": "InstructionsClean the pork and pat dry. Add the pork rub to the shoulder and season all over. Place the pork shoulder into the crock pot and set the temperature to low. Add in the vegetable broth and cook on low for 8-10 hours. Remove from slow cooker and shred the pork. Top the nachos with the shredded pork, pico de gallo, shredded cheese, and sour cream if desired.",
            "sourceUrl": "https://www.pinkwhen.com/pulled-pork-nachos/",
            "image": "https://spoonacular.com/recipeImages/1039293-556x370.jpg",
            "id": 1039293
        },
        {
            "title": "Black Bean and Peppers Taco Filling",
            "readyInMinutes": 45,
            "summary": "The recipe Black Bean and Peppers Taco Filling is ready <b>in roughly 45 minutes</b> and is definitely an excellent <b>gluten free and vegan</b> option for lovers of Mexican food. For <b>52 cents per serving</b>, this recipe <b>covers 11%</b> of your daily requirements of vitamins and minerals. This recipe makes 8 servings with <b>117 calories</b>, <b>5g of protein</b>, and <b>3g of fat</b> each. This recipe is liked by 10 foodies and cooks. Head to the store and pick up chili powder, paprika, canned tomatoes, and a few other things to make it today. All things considered, we decided this recipe <b>deserves a spoonacular score of 87%</b>. This score is amazing. Try <a href=\"https://spoonacular.com/recipes/kale-turkey-and-black-bean-taco-filling-plus-5-ways-to-use-it-506463\">Kale, Turkey and Black Bean Taco Filling -Plus 5 Ways to Use It</a>, <a href=\"https://spoonacular.com/recipes/pinquito-bean-and-quinoa-taco-filling-628625\">Pinquito Bean and Quinoa Taco Filling</a>, and <a href=\"https://spoonacular.com/recipes/easy-baked-refried-bean-dip-or-taco-or-burrito-filling-859342\">Easy Baked Refried Bean Dip (or taco or burrito filling)</a> for similar recipes.",
            "vegetarian": true,
            "instructions": "<ol><li>In a skillet add olive oil, onions and bell pepper. Cook until tender, about 3  5 minutes. Add tomatoes and seasonings, saute for 10 minutes. Add black beans and cook until warm.</li><li>Serve with tortillas.</li><li>Additional toppings: Romaine Lettuce, Cheese, jalapenos, salsa, hot sauce, avocado, and greek yogurt</li></ol>",
            "sourceUrl": "http://www.foodista.com/recipe/L7GY4PX3/black-bean-and-peppers-taco-filling",
            "image": "https://spoonacular.com/recipeImages/635058-556x370.jpg",
            "id": 635058
        },
        {
            "title": "Chicken Enchilada Casserole",
            "readyInMinutes": 45,
            "summary": "Chicken Enchilada Casserole is a Mexican main course. This recipe serves 8 and costs $1.22 per serving. One portion of this dish contains around <b>17g of protein</b>, <b>12g of fat</b>, and a total of <b>286 calories</b>. This recipe is liked by 9022 foodies and cooks. <b>Autumn</b> will be even more special with this recipe. If you have canned tomatoes, green onion tops optional, chicken pre, and a few other ingredients on hand, you can make it. From preparation to the plate, this recipe takes approximately <b>45 minutes</b>. It is brought to you by Pink When. With a spoonacular <b>score of 0%</b>, this dish is improvable. Try <a href=\"https://spoonacular.com/recipes/chicken-enchilada-casserole-108065\">Chicken Enchilada Casserole</a>, <a href=\"https://spoonacular.com/recipes/chicken-enchilada-casserole-145339\">Chicken Enchilada Casserole</a>, and <a href=\"https://spoonacular.com/recipes/chicken-enchilada-casserole-890348\">Chicken Enchilada Casserole</a> for similar recipes.",
            "vegetarian": false,
            "instructions": "Instructions\n\nHeat oven to 375. Prepare a 9 x 13 baking dish and begin by placing a layer of tortillas on the bottom of the dish.\n\nThen add a layer of chicken and 1/4 a cup of the shredded cheese.\n\nAdd on half a can of tomatoes and green chilies and one can of the verde enchilada sauce.\n\nFinish the layer with a half a can of the refried beans.\n\nThen cover with another layer of flour tortilla pieces, and start the layering process again.\n\nOnce you are finished layering, cover the top with the remaining shredded cheese.\n\nCover with foil, and then bake in the oven for 30 minutes.\n\nRemove the foil, add a few green onion tops, and bake for an additional 5 minutes until the cheese is melted and bubbly. Allow to sit for 10-15 minutes to allow to cool before serving. Serving any sooner may give you a soupy, but still delicious dinner.",
            "sourceUrl": "https://www.pinkwhen.com/chicken-enchilada-casserole-recipe/",
            "image": "https://spoonacular.com/recipeImages/715394-556x370.jpg",
            "id": 715394
        },
        {
            "title": "Jean's Seafood Gumbo",
            "readyInMinutes": 45,
            "summary": "If you want to add more <b>Cajun</b> recipes to your recipe box, Jean's Seafood Gumbo might be a recipe you should try. For <b>$5.32 per serving</b>, this recipe <b>covers 50%</b> of your daily requirements of vitamins and minerals. One serving contains <b>558 calories</b>, <b>72g of protein</b>, and <b>20g of fat</b>. This recipe serves 9. 6 people have tried and liked this recipe. Only a few people really liked this main course. It is a good option if you're following a <b>dairy free</b> diet. If you have canned tomatoes, creole seasoning, peppers, and a few other ingredients on hand, you can make it. From preparation to the plate, this recipe takes about <b>about 45 minutes</b>. It is brought to you by Foodista. Taking all factors into account, this recipe <b>earns a spoonacular score of 87%</b>, which is great. <a href=\"https://spoonacular.com/recipes/seafood-gumbo-411231\">Seafood Gumbo</a>, <a href=\"https://spoonacular.com/recipes/seafood-gumbo-34779\">Seafood Gumbo</a>, and <a href=\"https://spoonacular.com/recipes/seafood-gumbo-971756\">Seafood Gumbo</a> are very similar to this recipe.",
            "vegetarian": false,
            "instructions": "Fill a 14-16-quart pot with two quarts of water and bring to a boil.\nMeanwhile, peel and devein the shrimp, keeping the heads and hulls. Set the shrimp aside in cold water. In the large \"gumbo pot\" boil heads and hulls for 30 minutes to an hour. This will give you Creole gumbo. Strain shrimp heads and hulls from stock and set aside. Discard heads and hull immediately. Otherwise, the next day your kitchen will smell like Bayou St. John.\nClean the fresh crabs  If the crabs are fresh, you must take time to clean them. Discard the hard back shell and some of the so-called \"dead man,\" or yellow insides. Clean and separate crabs and set aside. (Note: If necessary, you can use meat from king, Dungeness, snow or stone crabs for your gumbo).\nBefore you fire up the stove again, cut up your celery, parsley, peppers, onions and garlic, especially if you're alone and there is no one to help you stir the pots. It takes time peeling the onions and garlic  Put the celery and parsley in a separate container from the other chopped ingredients and refrigerate until needed to keep them fresh.\nPlace the gumbo pot with the shrimp stock on the stove. Add cleaned crabs and bay leaves. Stir slowly. You don't want your shrimp stock messing up the floor. Add celery, parsley, and tomato paste to the gumbo brewing on the stove. Bring to a boil. Turn down heat, cover, and let simmer.\nHere comes the roux -- a thick and flavorful sauce that has become one of the most important staples of Louisiana cuisine. Pour oil or shortening into a separate heavy skillet (please do not use a thin omelet pan) over a medium-low heat. Slowly stir in flour to make the roux. Keep your eyes on the skillet. If the phone rings, let the answering machine pick it up. Cook roux until it has a dark mahogany color. Do not stop stirring until roux appears nutty or grainy. If black specks appear, the roux is burned. Throw it out and start from scratch. A good roux could take 30 to 45 minutes cooking time.\nNow you are ready to add the holy trinity of onions, garlic, and green peppers to the roux mixture. Stir ingredients in slowly because the flour is still sizzling. The moisture will begin to disappear. This is when Jean would add another quart or two of water to the gumbo pot. Add roux to the gumbo pot. Bring to a boil, stirring constantly. Lower heat and cover. The kitchen should smell good right now. Pour yourself another cold something-or-other. You're halfway there. Come back to look and stir in an hour or so.\nSeason to taste: add salt, pepper, thyme, Worcestershire sauce, Tabasco sauce and any Creole seasoning you like. Don't overdo it right now. Let the roux work its magic absorbing all the wonderful ingredients. Gumbo is usually very spicy, but you can keep it mild. Remember, if you have decided to use andouille sausage it is also hot.\nFry sausages and okra with a little bit of the leftover grease. Sprinkle a little leftover flour if the okra is fresh. Add to gumbo pot. Add chopped peeled tomatoes, stirring until well blended. Add more water if necessary. The roux will keep it thick and tasty. Return to a boil and simmer for 10 minutes. Reduce heat and let simmer, uncovered, for 2 1/2 to 3 hours over low heat.\nSkim any excess fat. Add shrimp. Stir in slowly as you increase the heat one last time. It's time to stir in the fil powder. Cook another 20 to 30 minutes until the gumbo is thick. Taste and adjust seasonings one more time. Did I mention the rice? Seafood gumbo is served over Louisiana rice. Of course, you can substitute for your own favorite rice. Just plain old brown or white rice will do. Before serving, taste one more time and adjust seasoning. Turn off heat and remove seafood gumbo from the stove.\nTo cool down the pot before serving, place it in the sink with a few inches of ice-cold water. If needed, add additional salt and Tabasco sauce. If you can see through the gumbo to the bottom of the pot, work on your roux next time.",
            "sourceUrl": "https://www.foodista.com/recipe/Z2KPLCN3/jean-s-seafood-gumbo",
            "image": "",
            "id": 648524
        },
        {
            "title": "Bittersweet chocolate pudding",
            "readyInMinutes": 45,
            "summary": "Bittersweet chocolate pudding might be just the dessert you are searching for. For <b>50 cents per serving</b>, this recipe <b>covers 9%</b> of your daily requirements of vitamins and minerals. One serving contains <b>203 calories</b>, <b>6g of protein</b>, and <b>9g of fat</b>. 21 person have tried and liked this recipe. Head to the store and pick up salt, sugar, egg, and a few other things to make it today. It is a good option if you're following a <b>gluten free and vegetarian</b> diet. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 40%</b>. This score is solid. Try <a href=\"https://spoonacular.com/recipes/bittersweet-chocolate-pudding-760601\">Bittersweet Chocolate Pudding</a>, <a href=\"https://spoonacular.com/recipes/bittersweet-chocolate-pudding-204366\">Bittersweet Chocolate Pudding</a>, and <a href=\"https://spoonacular.com/recipes/bittersweet-chocolate-pudding-with-raspberries-126569\">Bittersweet Chocolate Pudding with Raspberries</a> for similar recipes.",
            "vegetarian": true,
            "instructions": "<ol><li>In a medium saucepan, whisk together the cornstarch, cocoa powder, sugar salt, and salt.</li><li>In a separate bowl, combine the milk and egg.</li><li>Gradually pour the milk mixture into the saucepan, whisking until thoroughly mixed.</li><li>Heat the mixture, stirring constantly, over medium heat until it boils. Cook for 1 minute, then remove from heat.</li><li>Stir in butter and vanilla extract.</li><li>Pour the pudding into the suitable molds rinsed with cold water (the pudding can be taken out more easily).</li><li>Chill.</li></ol>",
            "sourceUrl": "http://www.foodista.com/recipe/2BNXJNXN/bittersweet-chocolate-pudding",
            "image": "https://spoonacular.com/recipeImages/635041-556x370.jpg",
            "id": 635041
        }
    ]
}